# TITANIC

## import libraries

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## load data

In [2]:
data=pd.read_csv('titanic.csv')
data

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

### data dictinary


    column name               meaning 
    passengerid           number of the id cart
    survived              servived passenger?  "0" means NO
                                               "1" means YES                                                                    
     Pclass              Ticket class 1= 1st 2= 2nd 3=  3rd              
     Name                Name of passenger
     sex                 sex of passenger
     age                 age of passengers
     sibpb               # of sibilings/ 
                         spouses aboard the 
                         Titanic
    Parch               # of parents/ 
                         children aborard
                         the Titanic
    Ticket              ticket number
    Fare                Passenger fare
    cabin               cabin number
    Embarked            Port of Embarkation  C = Cherbourg, 
                                      Q = Queentown, 
                                      S = Southampton